In [23]:
import pandas as pd
import numpy as np
df_input = pd.read_csv("salaries.csv")

In [50]:
df_input = df_input.sample(frac=1)

In [51]:
df_input = df_input.head()

In [52]:
df_input

       company                  job     degree  age  salary_more_then_100k
3       google     business manager    masters   42                      1
7   abc pharma  computer programmer  bachelors   25                      0
8   abc pharma     business manager  bachelors   25                      0
12    facebook     business manager  bachelors   54                      1
9   abc pharma     business manager    masters   24                      1

In [53]:
# create a bootstrapped dataset by sampling with replacement
n = len(df_input)
bootstrap_indices = np.random.choice(n, size=n, replace=True)
bootstrapped_data = df_input.iloc[bootstrap_indices]

In [54]:
bootstrapped_data

       company               job     degree  age  salary_more_then_100k
9   abc pharma  business manager    masters   24                      1
8   abc pharma  business manager  bachelors   25                      0
12    facebook  business manager  bachelors   54                      1
12    facebook  business manager  bachelors   54                      1
9   abc pharma  business manager    masters   24                      1

In [55]:
missing_indices = set(df_input.index) - set(bootstrapped_data.index)
df_input.loc[list(missing_indices)]

      company                  job     degree  age  salary_more_then_100k
3      google     business manager    masters   42                      1
7  abc pharma  computer programmer  bachelors   25                      0